{
    "userBooks": {
        "LfAJT0xxa4RKZs7DKTda2YiEUvA3": {
            "1250077737": {
                "authors": "Melissa Bashardoust",
                "description": "Melissa Bashardoust’s acclaimed debut novel Girls Made of Snow and Glass is “Snow White as it’s never been told before...a feminist fantasy fairy tale not to be missed” (BookPage)! “Utterly superb.” —ALA Booklist, starred review “Dark, fantastical, hauntingly evocative.” —Kirkus Reviews, starred review “An empowering and progressive original retelling.” —SLJ, starred review Sixteen-year-old Mina is motherless, her magician father is vicious, and her silent heart has never beat with love for anyone—has never beat at all, in fact, but she’d always thought that fact normal. She never guessed that her father cut out her heart and replaced it with one of glass. When she moves to Whitespring Castle and sees its king for the first time, Mina forms a plan: win the king’s heart with her beauty, become queen, and finally know love. The only catch is that she’ll have to become a stepmother. Fifteen-year-old Lynet looks just like her late mother, and one day she discovers why: a magician created her out of snow in the dead queen’s image, at her father’s order. But despite being the dead queen made flesh, Lynet would rather be like her fierce and regal stepmother, Mina. She gets her wish when her father makes Lynet queen of the southern territories, displacing Mina. Now Mina is starting to look at Lynet with something like hatred, and Lynet must decide what to do—and who to be—to win back the only mother she’s ever known...or else defeat her once and for all. Entwining the stories of both Lynet and Mina in the past and present, Girls Made of Snow and Glass traces the relationship of two young women doomed to be rivals from the start. Only one can win all, while the other must lose everything—unless both can find a way to reshape themselves and their story.",
                "image": "http://books.google.com/books/content?id=064sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=064sDwAAQBAJ&dq=isbn:9781250077738&hl=&source=gbs_api",
                "isbn10": "1250077737",
                "isbn13": "9781250077738",
                "publishedDate": "2017-09-05",
                "title": "Girls Made of Snow and Glass"
            },
            "1250138671": {
                "authors": "Taran Matharu",
                "description": "The fourth book in Matharu's \"New York Times\"Dbestselling Summoner seriesis the prequel story of Arcturus and how he rose from boy summoner to head ofVocans Academy.",
                "image": "http://books.google.com/books/content?id=4ndQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=4ndQDwAAQBAJ&dq=isbn:9781250138675&hl=&source=gbs_api",
                "isbn10": "1250138671",
                "isbn13": "9781250138675",
                "publishedDate": "2018-05",
                "title": "The Outcast"
            },
            "1250178630": {
                "authors": "Kristin Hannah",
                "description": "\"When twenty-year-old nursing student Frances \"Frankie\" McGrath hears these unexpected words, it is a revelation. Raised on idyllic Coronado Island and sheltered by her conservative parents, she has always prided herself on doing the right thing, being a good girl. But in 1965 the world is changing, and she suddenly imagines a different choice for her life. When her brother ships out to serve in Vietnam, she impulsively joins the Army Nurse Corps and follows his path. As green and inexperienced as the men sent to Vietnam to fight, Frankie is overwhelmed by the chaos and destruction of war, as well as the unexpected trauma of coming home to a changed and politically divided America.\"--",
                "image": "http://books.google.com/books/content?id=ALG9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=ALG9EAAAQBAJ&dq=isbn:9781250178633&hl=&source=gbs_api",
                "isbn10": "1250178630",
                "isbn13": "9781250178633",
                "publishedDate": "2024-02-06",
                "title": "The Women"
            },
            "1481497588": {
                "authors": "Margaret Rogerson",
                "description": "A skilled painter must stand up to the ancient power of the faerie courts--even as she falls in love with a faerie prince--in this gorgeous debut novel. 6 x 9.",
                "image": "http://books.google.com/books/content?id=C4Q2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=C4Q2DwAAQBAJ&dq=isbn:9781481497589&hl=&source=gbs_api",
                "isbn10": "1481497588",
                "isbn13": "9781481497589",
                "publishedDate": "2017-09-26",
                "title": "An Enchantment of Ravens"
            },
            "1534485007": {
                "authors": "Nafiza Azad",
                "description": "Croi is compelled by a summoning spell leave her home in the Wilde Forest and travel into the Otherworld, where the enchantment that made her into a brownie begins to break, revealing her true identity, her hidden magick, and her forgotten heritage.",
                "image": "http://books.google.com/books/content?id=hhLYEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=hhLYEAAAQBAJ&dq=isbn:9781534485006&hl=&source=gbs_api",
                "isbn10": "1534485007",
                "isbn13": "9781534485006",
                "publishedDate": "2023-10-17",
                "title": "Road of the Lost"
            },
            "1665926910": {
                "authors": "Emma Mills",
                "description": "Seventeen-year-old Aurelie, a baker's apprentice, reluctantly agrees to assist a bounty hunter named Iliana and finds herself on an adventure full of magic, danger, and the thrill of first love.",
                "image": "http://books.google.com/books/content?id=jCC_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=jCC_EAAAQBAJ&dq=isbn:9781665926911&hl=&source=gbs_api",
                "isbn10": "1665926910",
                "isbn13": "9781665926911",
                "publishedDate": "2023-06-13",
                "title": "Something Close to Magic"
            },
            "1665930462": {
                "authors": "Scott Reintgen",
                "description": "Seeking revenge, Ren Monroe teams up with Vin'Tori siblings Dahvid and Nevelyn to take down House Brood, the most powerful family in Kathor, but Ren's magical bond with Theo Brood complicates her plans.",
                "image": "http://books.google.com/books/content?id=7kf9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "http://books.google.com/books?id=7kf9EAAAQBAJ&dq=isbn:9781665930468&hl=&source=gbs_api",
                "isbn10": "1665930462",
                "isbn13": "9781665930468",
                "publishedDate": "2024-04-23",
                "title": "A Whisper in the Walls"
            },
            "undefined": {
                "authors": "Emily Brontë",
                "description": "Emily Brontë’s “Wuthering Heights” is considered one of the greatest novels ever wrote. It also can be difficult to understand--it is loaded with themes, imagery, and symbols. If you need a little help understanding it, let BookCaps help with this study guide. Along with chapter-by-chapter summaries and analysis, this book features the full text of Brontë's classic novel is also included. BookCap Study Guides are not meant to be purchased as alternatives to reading the book.",
                "image": "http://books.google.com/books/content?id=S2Yvf-tWNdUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "infoLink": "https://play.google.com/store/books/details?id=S2Yvf-tWNdUC&source=gbs_api",
                "isbn10": "1621074560",
                "isbn13": "9781621074564",
                "publishedDate": "2012-12-10",
                "title": "Wuthering Heights in Plain and Simple English (Includes Study Guide, Complete Unabridged Book, Historical Context, Biography And"
            }
        }
    }
}